Revit 2024 API
ParameterTypeId.ImportInstanceCuttingInView Property
 "Enable Cutting in Views"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ImportInstanceCuttingInView { get; }
Visual Basic
Public Shared ReadOnly Property ImportInstanceCuttingInView As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ImportInstanceCuttingInView {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace